//
//  GroupCategory.swift
//  VK Admin
//
//  Created by Orange on 27.10.16.
//  Copyright © 2016 Dmitry Bobrov. All rights reserved.
//

import Foundation

let groupSubjectList: [Int:String] = [
	0 : "не выбрано",
	1 : "авто/мото",
	2 : "активный отдых",
	3 : "бизнес",
	4 : "домашние животные",
	5 : "здоровье",
	6 : "знакомство и общение",
	7 : "игры",
	8 : "ИТ (компьютеры и софт)",
	9 : "кино",
	10 : "красота и мода",
	11 : "кулинария",
	12 : "культура и искусство",
	13 : "литература",
	14 : "мобильная связь и интернет",
	15 : "музыка",
	16 : "наука и техника",
	17 : "недвижимость",
	18 : "новости и СМИ",
	19 : "безопасность",
	20 : "образование",
	21 : "обустройство и ремонт",
	22 : "политика",
	23 : "продукты питания",
	24 : "промышленность",
	25 : "путешествия",
	26 : "работа",
	27 : "развлечения",
	28 : "религия",
	29 : "дом и семья",
	30 : "спорт",
	31 : "страхование",
	32 : "телевидение",
	33 : "товары и услуги",
	34 : "увлечения и хобби",
	35 : "финансы",
	36 : "фото",
	37 : "эзотерика",
	38 : "электроника и бытовая техника",
	39 : "эротика",
	40 : "юмор",
	41 : "общество, гуманитарные науки",
	42 : "дизайн и графика"
]

class GroupSubject {
	var name: String?
	var id: Int {
		set {
			self.name = groupSubjectList[self.id]!
		} get {
			return self.id
		}
	}

	init(id: Int?) {
		if id != nil && (0..<groupSubjectList.count).contains(id!) {
			self.id = id!
		} else {
			self.id = 0
		}
	}

	class func GetGroupSubjectList() -> [Int:String] { //дабы не обращаться напрямую к переменной
		return groupSubjectList
	}
}
